<template>
  <div @scroll="onScroll" :class="{'about_main': isAboutPage}" class="about">
    <div class="about__body">
      <div class="about__block">
        <div class="about__image image">
          <router-link to="/about" class="image__item">
            <img src="@/assets/images/portrait/Ula_52965_DONE-min.jpg" alt="">
          </router-link>
        </div>
        <div v-if="!isAboutPage" class="about__title title">about</div>
        <div v-if="isAboutPage" class="about__quote">«То хорошее, что мы получаем от искусства, — это не то, чему оно нас учит, а то, чем мы становимся благодаря ему»</div>
        <div v-if="isAboutPage" class="about__author">Оскар Уайлд</div>
      </div>
      <div class="about__content">
        <div v-if="isAboutPage" class="about__title title">about</div>
        <p>Современной визуальной культуре присуще упрощение образов, в том числе и в скульптуре.
          Абстрактные формы задают нам вопрос: «Ты чувствуешь?». Работы ULAFONBERBER не стремятся к
          упрощению внешнего, но направляют нас к чистоте и гармонии внутреннего. Тихим шепотом они
          спрашивают нас: «Ты слышишь?».</p>
        <p>ULAFONBERBER</p>
        <div v-if="isAboutPage" class="about__title title">about</div>
        <p>Современной визуальной культуре присуще упрощение образов, в том числе и в скульптуре.
          Абстрактные формы задают нам вопрос: «Ты чувствуешь?». Работы ULAFONBERBER не стремятся к
          упрощению внешнего, но направляют нас к чистоте и гармонии внутреннего. Тихим шепотом они
          спрашивают нас: «Ты слышишь?».</p>
        <p>ULAFONBERBER</p>
        <div v-if="isAboutPage" class="about__title title">about</div>
        <p>Современной визуальной культуре присуще упрощение образов, в том числе и в скульптуре.
          Абстрактные формы задают нам вопрос: «Ты чувствуешь?». Работы ULAFONBERBER не стремятся к
          упрощению внешнего, но направляют нас к чистоте и гармонии внутреннего. Тихим шепотом они
          спрашивают нас: «Ты слышишь?».</p>
        <p>ULAFONBERBER</p>
        <div v-if="isAboutPage" class="about__title title">about</div>
        <p>Современной визуальной культуре присуще упрощение образов, в том числе и в скульптуре.
          Абстрактные формы задают нам вопрос: «Ты чувствуешь?». Работы ULAFONBERBER не стремятся к
          упрощению внешнего, но направляют нас к чистоте и гармонии внутреннего. Тихим шепотом они
          спрашивают нас: «Ты слышишь?».</p>
        <p>ULAFONBERBER</p>
        <div v-if="isAboutPage" class="about__title title">about</div>
        <p>Современной визуальной культуре присуще упрощение образов, в том числе и в скульптуре.
          Абстрактные формы задают нам вопрос: «Ты чувствуешь?». Работы ULAFONBERBER не стремятся к
          упрощению внешнего, но направляют нас к чистоте и гармонии внутреннего. Тихим шепотом они
          спрашивают нас: «Ты слышишь?».</p>
        <p>ULAFONBERBER</p>
        <p v-if="isAboutPage">
          Имя ULA воплощает все светское, социальное, то есть осознаваемое. FON означает
          принадлежность к месту, к роду... к своим корням, которые прочно удерживают нас в
          равновесии. BERBER олицетворяет глубинную свободу и силу духа, подобную той, что позволила
          древним племенам Северной Африки – берберам – сохранить свои традиции и язык, свою истинную
          природу даже под натиском мусульманских завоеваний.
          Греческие корни и академическое образование сформировали у скульптора приверженность к
          реалистическому классическому искусству. В то же время ей особенно близка философия
          тибетской духовной традиции Юндрунг Бон, направленной на достижение счастья и благополучия
          через обретение абсолютной свободы. Она наполняет работы ULA гармонией, рождающей истинную
          красоту. Согласно этому древнему учению, причина человеческих страданий не находится вовне,
          а есть следствие наших собственных заблуждений. Как и все духовные учения, Юндрунг Бон
          стремится помогать всем живым существам и делать их жизнь лучше. Поэтому оно не противоречит
          ни одной религии. А скорее наоборот, призывает к осознанной опоре на традиции в поисках
          баланса.
        </p>
        <p v-if="isAboutPage">
          Свое воплощение эта идея нашла в одноименной скульптуре. На первый взгляд, тибетский
          мальчик-монах забавляется, пытаясь удержаться на толстой верёвке. Однако, по замыслу автора,
          он олицетворяет постоянную работу над собой в стремлении сохранить свое внутреннее
          равновесие.
        </p>
        <a v-if="!isAboutPage" href="" class="about__link link">Читать далее</a>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "AboutBlock",
  computed: {
    isAboutPage() {
      return this.$route.path === '/about'
    }
  },
  methods: {
    onScroll() {
      console.log('test')
    }
  },
  mounted() {
    // window.addEventListener('scroll', fun)
  }
}
</script>


<style scoped lang="scss">

</style>
