<template>
  <div class="about">
    <div class="about__item item-about">
      <div class="item-about__block">
        <div class="item-about__image image">
          <router-link to="/" class="image__item">
            <img src="@/assets/images/portrait/Ula_52965_DONE-min.jpg" alt="">
          </router-link>
        </div>

        <div class="item-about__title title">about</div>
      </div>
      <div class="item-about__text">
        <p>Современной визуальной культуре присуще упрощение образов, в том числе и в скульптуре.
          Абстрактные формы задают нам вопрос: «Ты чувствуешь?». Работы ULAFONBERBER не стремятся к
          упрощению внешнего, но направляют нас к чистоте и гармонии внутреннего. Тихим шепотом они
          спрашивают нас: «Ты слышишь?».</p>
        <p>ULAFONBERBER</p>
        <p>
          Имя ULA воплощает все светское, социальное, то есть осознаваемое. FON означает
          принадлежность к месту, к роду... к своим корням, которые прочно удерживают нас в
          равновесии. BERBER олицетворяет глубинную свободу и силу духа, подобную той, что позволила
          древним племенам Северной Африки – берберам – сохранить свои традиции и язык, свою истинную
          природу даже под натиском мусульманских завоеваний.
          Греческие корни и академическое образование сформировали у скульптора приверженность к
          реалистическому классическому искусству. В то же время ей особенно близка философия
          тибетской духовной традиции Юндрунг Бон, направленной на достижение счастья и благополучия
          через обретение абсолютной свободы. Она наполняет работы ULA гармонией, рождающей истинную
          красоту. Согласно этому древнему учению, причина человеческих страданий не находится вовне,
          а есть следствие наших собственных заблуждений. Как и все духовные учения, Юндрунг Бон
          стремится помогать всем живым существам и делать их жизнь лучше. Поэтому оно не противоречит
          ни одной религии. А скорее наоборот, призывает к осознанной опоре на традиции в поисках
          баланса.
          Свое воплощение эта идея нашла в одноименной скульптуре. На первый взгляд, тибетский
          мальчик-монах забавляется, пытаясь удержаться на толстой верёвке. Однако, по замыслу автора,
          он олицетворяет постоянную работу над собой в стремлении сохранить свое внутреннее
          равновесие.
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "AboutBlock",
}
</script>


<style scoped lang="scss">

</style>
